## 🏗️ Terraform Plan Summary

**Environment:** 🧪 `dev`

| Step | Status |
|------|:------:|
| 🖌 Format & Style | ✅ `success` |
| ⚙️ Initialization | ✅ `success` |
| 🤖 Validation | ✅ `success` |
| 📖 Plan | ✅ `success` |

<details><summary>Plan Output</summary>

```terraform
data.terraform_remote_state.main: Reading...
random_id.bucket_suffix: Refreshing state... [id=usTc4Q]
data.terraform_remote_state.main: Read complete after 0s
google_service_account.app: Refreshing state... [id=projects/doug-hayden-eng-sandbox/serviceAccounts/agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_vertex_ai_reasoning_engine.session_and_memory: Refreshing state... [id=projects/136454482223/locations/us-central1/reasoningEngines/8356485183678971904]
google_storage_bucket.artifact_service: Refreshing state... [id=agent-foundation-dev-artifact-service-bac4dce1]
google_project_iam_member.app["roles/cloudtrace.agent"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/cloudtrace.agent/serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/logging.logWriter"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/logging.logWriter/serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/serviceusage.serviceUsageConsumer"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/serviceusage.serviceUsageConsumer/serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/telemetry.tracesWriter"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/telemetry.tracesWriter/serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/storage.objectUser"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/storage.objectUser/serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/aiplatform.user"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/aiplatform.user/serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/storage.bucketViewer"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/storage.bucketViewer/serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_cloud_run_v2_service.app["us-central1"]: Refreshing state... [id=projects/doug-hayden-eng-sandbox/locations/us-central1/services/agent-foundation-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_cloud_run_v2_service.app["us-central1"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_cloud_run_v2_service" "app" {
      + annotations             = (known after apply)
      + binary_authorization    = (known after apply)
      + build_config            = (known after apply)
      + client                  = (known after apply)
      + client_version          = (known after apply)
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + custom_audiences        = (known after apply)
      + default_uri_disabled    = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = (known after apply)
      + description             = (known after apply)
      + effective_annotations   = (known after apply)
      + effective_labels        = (known after apply)
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + invoker_iam_disabled    = (known after apply)
      + labels                  = (known after apply)
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "us-central1"
      + multi_region_settings   = (known after apply)
      + name                    = "agent-foundation-dev"
      + observed_generation     = (known after apply)
      + reconciling             = (known after apply)
      + scaling                 = (known after apply)
      + template                = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = (known after apply)
      + traffic                 = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)
    }

  # google_cloud_run_v2_service.app["us-central1"] will be updated in-place
  ~ resource "google_cloud_run_v2_service" "app" {
        id                      = "projects/doug-hayden-eng-sandbox/locations/us-central1/services/agent-foundation-dev"
        name                    = "agent-foundation-dev"
        # (34 unchanged attributes hidden)

      ~ template {
            # (11 unchanged attributes hidden)

          ~ containers {
              ~ image          = "us-central1-docker.pkg.dev/doug-hayden-eng-sandbox/agent-foundation-dev/agent-foundation@sha256:2e7f07288d748cb0acab0bc3c177e3a2410d80378a5772086a3630cb089c8ebc" -> "us-central1-docker.pkg.dev/doug-hayden-eng-sandbox/agent-foundation-dev/agent-foundation@sha256:f74aa8da228e074920f2c4decc7a79e1d48445ff6b2a1ba4e5b8d7138ff4b954"
                name           = null
                # (6 unchanged attributes hidden)

                # (17 unchanged blocks hidden)
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ cloud_run_services               = {
      ~ us-central1 = {
          ~ latest_ready_revision = "agent-foundation-dev-00013-c2d" -> (known after apply)
          ~ update_time           = "2026-02-23T17:08:22.611221Z" -> (known after apply)
          ~ uri                   = "https://agent-foundation-dev-645mxjt3sq-uc.a.run.app" -> (known after apply)
        }
    }
  ~ deployed_image                   = "us-central1-docker.pkg.dev/doug-hayden-eng-sandbox/agent-foundation-dev/agent-foundation@sha256:2e7f07288d748cb0acab0bc3c177e3a2410d80378a5772086a3630cb089c8ebc" -> "us-central1-docker.pkg.dev/doug-hayden-eng-sandbox/agent-foundation-dev/agent-foundation@sha256:f74aa8da228e074920f2c4decc7a79e1d48445ff6b2a1ba4e5b8d7138ff4b954"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan-dev

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan-dev"
```

</details>

---